[
  {
    "id": 1,
    "titleBr": "Estágios na PUCRS",
    "titleUs": "Internships at PUCRS",
    "link": "https://github.com/brisolarag/visualizadorEstagiosPUCRS",
    "shortDescBr": "Automação para obter informações sobre estágios disponíveis na PUCRS Carreiras.",
    "shortDescUs": "Automation to obtain information about available internships at PUCRS Careers.",
    "descriptionBr": "A automação foi desenvolvida em Python, utilizando as bibliotecas Selenium e OpenPyxl, e tem a capacidade de exportar informações sobre os estágios disponíveis no site PUCRS Carreiras de acordo com o curso selecionado. Essa solução automatizada simplifica o processo de obtenção de informações sobre estágios, futuramente devo implementar uma função de notificação por whatsapp.",
    "descriptionUs": "The automation was developed in Python, using the Selenium and OpenPyxl libraries, and has the ability to export information about internships available on the PUCRS Careers website according to the selected course. This automated solution simplifies the process of obtaining information about internships, and in the future, I plan to implement a WhatsApp notification function.",
    "dataBr": "jan/22",
    "dataUs": "jan/22",
    "ano": 2022
  },
  {
    "id": 2,
    "titleBr": "Sistema de Login (Backend)",
    "titleUs": "Login System (Backend)",
    "link": "https://github.com/brisolarag/SistemaDeLogin",
    "shortDescBr": "Sistema de backend para autenticação segura e verificação de login.",
    "shortDescUs": "Backend system for secure authentication and login verification.",
    "descriptionBr": "O sistema de backend foi desenvolvido usando Node.js, com as bibliotecas JsonWebTokens e Bcrypt, para oferecer funcionalidades de autenticação e verificação de login. Além disso, foi implementado um sistema de cadastro. Esse conjunto de recursos permite aos usuários criar contas, fazer login de forma segura e autenticar-se para acessar funcionalidades restritas. A utilização do JsonWebTokens proporciona uma camada adicional de segurança, enquanto o Bcrypt garante que as senhas dos usuários sejam armazenadas de forma segura.",
    "descriptionUs": "The backend system was developed using Node.js, with the JsonWebTokens and Bcrypt libraries, to provide authentication and login verification functionalities. Additionally, a registration system has been implemented. This set of features allows users to create accounts, securely log in, and authenticate to access restricted features. The use of JsonWebTokens provides an additional layer of security, while Bcrypt ensures that users' passwords are securely stored.",
    "dataBr": "abr/22",
    "dataUs": "apr/22",
    "ano": 2022
  },
  {
    "id": 3,
    "titleBr": "ChromeTrack",
    "titleUs": "ChromeTrack",
    "link": "https://github.com/brisolarag/ChromeTrack",
    "shortDescBr": "Extensão para rastreamento de encomendas no Google Chrome.",
    "shortDescUs": "Extension for package tracking in Google Chrome.",
    "descriptionBr": "A extensão para Google Chrome foi desenvolvida para rastrear encomendas de forma conveniente, utilizando a API do Link&Track. Com essa extensão instalada, os usuários podem inserir os números de rastreamento de suas encomendas diretamente no navegador e obter informações atualizadas sobre o status de entrega.",
    "descriptionUs": "The Google Chrome extension was developed to conveniently track orders using the Link&Track API. With this extension installed, users can enter their tracking numbers directly into the browser and get updated information on the delivery status.",
    "dataBr": "mai/22",
    "dataUs": "may/22",
    "ano": 2022
  },
  {
    "id": 4,
    "titleBr": "Lista de Tarefas (FrontEnd)",
    "titleUs": "TodoList (FrontEnd)",
    "link": "https://github.com/brisolarag/todo-list-frontend",
    "shortDescBr": "Página para adicionar, editar e excluir tarefas em uma lista de afazeres.",
    "shortDescUs": "Page to add, edit, and delete tasks on a to-do list.",
    "descriptionBr": "Página construída com ReactJs, é uma Lista de Tarefas. Com essa aplicação, os usuários podem adicionar, editar, marcar como concluídas e excluir tarefas em sua lista de afazeres. Além disso, as informações das tarefas são armazenadas em um banco de dados SQL, garantindo que os dados sejam armazenados e possam ser acessados novamente.",
    "descriptionUs": "Page built with ReactJs, it's a TodoList. With this application, users can add, edit, mark as completed, and delete tasks on their to-do list. Additionally, task information is stored in an SQL database, ensuring that data is stored and can be accessed again.",
    "dataBr": "mai/22",
    "dataUs": "may/22",
    "ano": 2022
  },
  {
    "id": 5,
    "titleBr": "TRemover",
    "titleUs": "TRemover",
    "link": "https://github.com/brisolarag/TRemover",
    "shortDescBr": "Sistema para limpeza de arquivos temporários no Windows.",
    "shortDescUs": "System for cleaning temporary files on Windows.",
    "descriptionBr": "O sistema de limpeza de arquivos temporários para Windows é uma solução personalizável que oferece a capacidade de gerenciar e adicionar caminhos adicionais para limpeza. Essa flexibilidade permite que os usuários adaptem o sistema de acordo com suas necessidades específicas, garantindo uma limpeza abrangente e eficiente de arquivos temporários em seus computadores. Com essa personalização, é possível manter o sistema livre de dados desnecessários, melhorando o desempenho e liberando espaço em disco conforme desejado.",
    "descriptionUs": "The temporary file cleanup system for Windows is a customizable solution that provides the ability to manage and add additional paths for cleanup. This flexibility allows users to adapt the system according to their specific needs, ensuring comprehensive and efficient cleanup of temporary files on their computers. With this customization, it is possible to keep the system free from unnecessary data, improving performance and freeing up disk space as desired.",
    "dataBr": "jan/23",
    "dataUs": "jan/23",
    "ano": 2023
  },
  {
    "id": 6,
    "titleBr": "Mensagens para o Portfólio",
    "titleUs": "Portfolio Messages",
    "link": "https://github.com/brisolarag/controle-de-mensagens-portfolio",
    "shortDescBr": "Sistema para exibir mensagens enviadas ao portfólio em uma página privada.",
    "shortDescUs": "System to display messages sent to the portfolio on a private page.",
    "descriptionBr": "É um sistema que pega as mensagens que são enviadas ao meu portfólio (esta página) e mostra em outra página privada minha, que fornece as informações em forma de tabela, onde eu consigo redirecionar para meu email, ou whatsapp.",
    "descriptionUs": "It is a system that takes the messages that are sent to my portfolio (this page) and shows them on another private page of mine, which provides the information in the form of a table, where I can redirect to my email or WhatsApp.",
    "dataBr": "mar/23",
    "dataUs": "mar/23",
    "ano": 2023
  },
  {
    "id": 7,
    "titleBr": "BrainREST",
    "titleUs": "BrainREST",
    "link": "https://github.com/brisolarag/BrainREST",
    "shortDescBr": "Temporizador pomodoro com estatísticas.",
    "shortDescUs": "Pomodoro timer with statistics.",
    "descriptionBr": "Um temporizador pomodoro, que guarda as estatísticas.",
    "descriptionUs": "A pomodoro timer, which saves statistics.",
    "dataBr": "set/23",
    "dataUs": "sep/23",
    "ano": 2023
  },
  {
    "id": 8,
    "titleBr": "API (Filmes)",
    "titleUs": "API (Movies)",
    "link": "https://github.com/brisolarag/desiafiotecnicoubots",
    "shortDescBr": "API para CRUD de um banco de dados de filmes com avaliação.",
    "shortDescUs": "API for CRUD of a movie database with rating.",
    "descriptionBr": "Foi um desafio pela empresa Ubots, onde eu precisava criar um API para CRUD de um banco de dados com filmes, com a possibilidade de avaliar um filme",
    "descriptionUs": "It was a challenge by the company Ubots, where I needed to create an API for CRUD of a movie database, with the possibility of evaluating a movie.",
    "dataBr": "jan/24",
    "dataUs": "jan/24",
    "ano": 2024
  },
  {
    "id": 9,
    "titleBr": "Árvore AVL e Detecção de Ciclos",
    "titleUs": "AVL Tree and Cycle Detection",
    "link": "https://github.com/brisolarag/desiafiotecnicoubots2",
    "shortDescBr": "Teste lógico sobre árvore AVL e detecção de ciclos.",
    "shortDescUs": "Logical test on AVL tree and cycle detection.",
    "descriptionBr": "Segunda etapa do teste realizado pela Ubots, envolvendo um teste lógico pelo Hackerrank de Árvore AVL e Detecção de Ciclos",
    "descriptionUs": "Second stage of the test conducted by Ubots, involving a logical test by Hackerrank of AVL Tree and Cycle Detection",
    "dataBr": "jan/24",
    "dataUs": "jan/24",
    "ano": 2024
  },
  {
    "id": 10,
    "titleBr": "Portfólio",
    "titleUs": "Portfolio",
    "link": "https://github.com/brisolarag/portfolio-new",
    "shortDescBr": "Portfólio para divulgação de projetos.",
    "shortDescUs": "Portfolio for project promotion.",
    "descriptionBr": "Criação do meu portfólio para divulgação dos meus projetos",
    "descriptionUs": "Creation of my portfolio for the promotion of my projects",
    "dataBr": "jan/24",
    "dataUs": "jan/24",
    "ano": 2024
  },
  {
    "id": 11,
    "titleBr": "API (Mensagens para o Portfólio)",
    "titleUs": "API (Portfolio Messages)",
    "link": "https://github.com/brisolarag/api-portfolio",
    "shortDescBr": "API para controle de mensagens enviadas ao portfólio.",
    "shortDescUs": "API for control of messages sent to the portfolio.",
    "descriptionBr": "Esta é uma API para este portfólio, para ter controle das mensagens enviadas pelo modal de mensagens.",
    "descriptionUs": "This is an API for this portfolio, to have control of the messages sent by the message modal.",
    "dataBr": "fev/24",
    "dataUs": "feb/24",
    "ano": 2024
  }
]
